docs: Another edit pass, convert diagram to mermaid
